{
  "basics": {
    "name": "Johannes L. Hörmann",
    "image": "",
    "email": "johannes.laurin@gmail.com",
    "url": "https://jotelha.github.io",
    "summary": "Computational tribologist, data explorer, and sinoenthusiast.",
    "location": {
      "address": "Hansjakobstr. 30",
      "postalCode": "79194",
      "city": "Gundelfingen",
      "countryCode": "Germany"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "jotelha",
        "url": "https://www.linkedin.com/in/jotelha"
      },
      {
        "network": "GitHub",
        "username": "jotelha",
        "url": "https://github.com/jotelha"
      }
    ]
  },
  "work": [
    {
      "name": "livMatS Cluster of Excellence, University of Freiburg, Germany",
      "position": "Data Steward",
      "url": "https://www.livmats.uni-freiburg.de/de/news-press/making-data-accessible-recognizing-technological-potential",
      "startDate": "2021-08",
      "summary": "Development and implementation of Research Data Management (RDM) policy. Development and provision of RDM tooling.",
      "highlights": ["RDM policy", "DMP review", "dtool & dserver development"]
    },
    {
      "name": "Surface Design Solutions",
      "position": "Co-founder",
      "url": "https://surface.design",
      "startDate": "2022-05",
      "endDate": "2023-09",
      "summary": "Co-founder and CTO of Start Up Surface Design Solutions",
      "highlights": ["RDM policy", "DMP review", "dtool & dserver development"]
    },
    {
      "position": "Parental Leave",
      "startDate": "2021-01",
      "endDate": "2021-07"
    },
    {
      "name": "Academic examination office, a joint institution of the German Embassy’s cultural department and the German Academic Exchange Service (DAAD)",
      "position": "Examiner",
      "url": "https://www.aps.org.cn",
      "startDate": "2017-02",
      "summary": "Conducting interviews for plausibility verification of academic records.",
      "highlights": ["Conversation planning and management"]
    }
  ],
  "education": [
    {
      "institution": "Simulation, Dept. of Microsystems Engineering (IMTEK), University of Freiburg",
      "location": "Freiburg, Germany",
      "url": "https://uni-freiburg.de",
      "area": "Microsystems Engineering",
      "studyType": "PhD",
      "startDate": "2017-07",
      "endDate": "2025-01",
      "courses": ["Dissertation: Friction of Adsorption Films with Reproducible Molecular Dynamics"]
    },
    {
      "institution": "Tsinghua University",
      "location": "Beijing, China",
      "url": "https://www.tsinghua.edu.cn",
      "area": "Mechanical Engineering / Engineering Science",
      "studyType": "Double Degree Master Program",
      "startDate": "2014-09",
      "endDate": "2017-01",
      "courses": [
        "Master thesis (grade 1.3, German scale): Computational Modeling of Potential-Controlled Dodecyl Sulfate Ion Adsorption at the Aqueous and Non-aqueous SDS Solution – Stainless Steel Interface"
      ]
    },
    {
      "institution": "Technische Universität Berlin",
      "location": "Berlin, Germany",
      "url": "https://www.tu.berlin",
      "area": "Engineering Science",
      "studyType": "M. Sc.",
      "startDate": "2012-09",
      "endDate": "2017-03",
      "score": "1.6",
      "courses": ["Mechatronics", "Numerics & Simulation"]
    },
    {
      "institution": "Freie Universität Berlin",
      "location": "Berlin, Germany",
      "url": "https://www.fu-berlin.de",
      "area": "Physics",
      "studyType": "B. Sc.",
      "startDate": "2012-09",
      "endDate": "2017-03",
      "score": "2.0",
      "courses": ["Bachelor thesis (grade 1.0, German scale): Large Scale Parallel Simulation of EPR Lineshape Spectra"]
    },
    {
      "institution": "Campe Gymnasium Holzminden",
      "location": "Holzminden, Germany",
      "url": "https://www.campe-hol.de",
      "studyType": "Abitur",
      "startDate": "2000-09",
      "endDate": "2007-06",
      "score": "1.3",
      "courses": ["Mathematics", "Latin", "Physics", "Politics"]
    }
  ],
  "awards": [
    {
      "title": "Trinational KTUR Summer School Entrepreneurship: Best Project Award",
      "date": "2022-09",
      "url": "https://www.youtube.com/watch?v=jgXHkJIGUOo"
    },
    {
      "title": "6th World Tribology Congress: Best Poster Award",
      "date": "2017-09"
    },
    {
      "title": "DAAD Annual Scholarship for Exchange Studies",
      "date": "2013-09",
      "awarder": "German Academic Exchange Service (DAAD)",
      "url": "https://www.daad.de",
      "summary": "studies at Tsinghua University, Beijing, China."
    },
    {
      "title": "DAAD Annual Scholarship for Language Studies / Huayu Enrichment Scholarship",
      "date": "2010-09",
      "awarder": "German Academic Exchange Service (DAAD) and Ministry of Education, Taiwan",
      "url": "https://en.wikipedia.org/wiki/Huayu_Enrichment_Scholarship",
      "summary": "language studies at National Sun Yat-Sen University, Kaohsiung, Taiwan."
    }
  ],
  "publications": [
    {
      "name": "dtool and dserver: A flexible ecosystem for findable data",
      "publisher": "PLOS ONE",
      "releaseDate": "2024-06-25",
      "url": "https://doi.org/10.1371/journal.pone.0306100",
      "summary": "Making data FAIR—findable, accessible, interoperable, reproducible—has become the recurring theme behind many research data management efforts. dtool is a lightweight data management tool that packages metadata with immutable data to promote accessibility, interoperability, and reproducibility. Each dataset is self-contained and does not require metadata to be stored in a centralised system. This decentralised approach means that finding datasets can be difficult. dtool’s lookup server, short dserver, as defined by a REST API, makes dtool datasets findable, hence rendering the dtool ecosystem fit for a FAIR data management world. Its simplicity, modularity, accessibility and standardisation via API distinguish dtool and dserver from other solutions and enable it to serve as a common denominator for cross-disciplinary research data management. The dtool ecosystem bridges the gap between standardisation-free data management by individuals and FAIR platform solutions with rigid metadata requirements."
    },
    {
      "name": "matscipy: materials science at the atomic scale with Python",
      "publisher": "Journal of Open Source Software",
      "releaseDate": "2024-01-28",
      "url": "https://doi.org/10.21105/joss.05668",
      "summary": "Behaviour of materials is governed by physical phenomena that occur at an extreme range of length and time scales. Computational modelling requires multiscale approaches. Simulation techniques operating on the atomic scale serve as a foundation for such approaches, providing necessary parameters for upper-scale models. The physical models employed for atomic simulations can vary from electronic structure calculations to empirical force fields. However, construction, manipulation and analysis of atomic systems are independent of the given physical model but dependent on the specific application. matscipy implements such tools for applications in materials science, including fracture, plasticity, tribology and electrochemistry."
    },
    {
      "name": "Molecular simulations of sliding on SDS surfactant films",
      "publisher": "The Journal of Chemical Physics",
      "releaseDate": "2023-06-28",
      "url": "https://doi.org/10.1063/5.0153397",
      "summary": "We use molecular dynamics simulations to study the frictional response of monolayers of the anionic surfactant sodium dodecyl sulfate and hemicylindrical aggregates physisorbed on gold. Our simulations of a sliding spherical asperity reveal the following two friction regimes: at low loads, the films show Amonton's friction with a friction force that rises linearly with normal load, and at high loads, the friction force is independent of the load as long as no direct solid–solid contact occurs. The transition between these two regimes happens when a single molecular layer is confined in the gap between the sliding bodies. The friction force at high loads on a monolayer rises monotonically with film density and drops slightly with the transition to hemicylindrical aggregates. This monotonous increase of friction force is compatible with a traditional plowing model of sliding friction. At low loads, the friction coefficient reaches a minimum at the intermediate surface concentrations. We attribute this behavior to a competition between adhesive forces, repulsion of the compressed film, and the onset of plowing."
    },
    {
      "name": "Molecular Simulations of Electrotunable Lubrication: Viscosity and Wall Slip in Aqueous Electrolytes",
      "publisher": "Tribology Letters",
      "releaseDate": "2021-01-30",
      "url": "https://doi.org/10.1007/s11249-020-01395-6",
      "summary": "We study the frictional response of water-lubricated gold electrodes subject to an electrostatic potential difference using molecular dynamics simulations. Contrary to previous studies on electrotunable lubrication that were carried out by fixing the charges, our simulations keep electrodes at fixed electrostatic potential using a variable charge method. For pure water and NaCl solutions, viscosity is independent of the polarization of the electrodes, but wall slip depends on the potential difference. Our findings are in agreement with previous analytical theories of how wall slip is affected by interatomic interactions. The simulations shed light on the role of electrode polarization for wall slip and illustrate a mechanism for controlling friction and nanoscale flow in simple aqueous lubricants."
    }
  ],
  "skills": [
    {
      "name": "methods",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "FEM with COMSOL, ANSYS, and FEniCSx",
        "MD sith GROMACS and LAMMPS",
        "DFTB with Atomistica",
        "DFT with CASTEP",
        "ML (GPR, GPC) with gpflow and sklearn",
        "Workflow Management with FireWorks and snakemake",
        "Data Management with dtool & dserver"
      ]
    },
    {
      "name": "DevOps skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["GitHub CI/CD", "OpenStack", "Docker", "Podman", "Singularity", "Make", "CMake","EasyBuild", "lmod", "Slurm", "MongoDB", "Flask", "REST API"]
    },
    {
      "name": "languages",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["Python", "C/C++", "MATLAB", "Mathematica", "LaTeX"]
    },
    {
      "name": "driver's license",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": ["motorbike", "car"]
    }
  ],
  "languages": [
    {
      "language": "German",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    },
    {
      "language": "Chinese",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
